package com.sinmem.peony.common.enums;

public enum Msg {
    S00000("成功", 0),
    E00001("数据空指针异常",1),
    E00002("系统依赖服务未启动",2),
    E11111("未定义错误",11111),
    E11112("未知的短信错误",11112),
    E10001("操作过于频繁",10001),

    E20000("数据库错误", 20000),
    E20001("插入标签数量不匹配",20001),
    E20002("标签重命名数量不匹配",20002),
    E20003("标签-法条删除数量错误",20003),
    E20004("标签计数器更新错误",20004),
    E20005("重复插入标签",20005),
    E20006("数据插入异常", 20006),
    E21001("分页查询越界",21001),
    E21002("查询已有数据",21002),

    E30001("备注申请操作类型错误",30001),

    E40001("需要登录",40001),// 4x为web security错误
    E40002("登录失败",40002),
    E40003("没有权限",40003),
    E40004("登录过期：您的身份验证已过期，请重新登录", 40004),
    E40005("验证码发送异常", 40005),
    E40006("用户已注册", 40006),
    E40007("邀请码填写失败", 40007),
    E40008("积分操作失败", 40008),
    E40009("用户数据错误", 40009),
    E40010("手机号错误", 40010),
    E40011("参数错误", 40011),
    E40012("参数为空", 40012),
    E40013("参数范围错误", 40013),
    E40014("参数存在性错误", 40014),

    E50001("http状态错误", 50001),
    W60001("分页查询空页",60001),
    ;
    public final String message;
    private final int code;

    Msg(String message, int code) {
        this.message = message;
        this.code = code;
    }

    public int code(){
        return this.code;
    }
    public boolean isError(){
        return this.code != 0;
    }
}
